Tekla Open API Reference for Tekla Structures 2025
ReinforcementBase.ReinforcementBaseAttributes Class
 The ReinforcementBaseAttributes class is the attributes class for the reinforcement.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Drawing.AttributesBase
 Tekla.Structures.Drawing.ReinforcementBase.ReinforcementBaseAttributes
 Tekla.Structures.Drawing.ReinforcementBase.ReinforcementGroupAttributes
 Tekla.Structures.Drawing.ReinforcementBase.ReinforcementMeshAttributes
 Tekla.Structures.Drawing.ReinforcementBase.ReinforcementSetGroupAttributes
 Tekla.Structures.Drawing.ReinforcementBase.ReinforcementSingleAttributes
 Tekla.Structures.Drawing.ReinforcementBase.ReinforcementStrandAttributes
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public abstract class ReinforcementBaseAttributes : AttributesBase
<SerializableAttribute>
Public MustInherit Class ReinforcementBaseAttributes
	Inherits AttributesBase
The ReinforcementBase.ReinforcementBaseAttributes type exposes the following members.
Properties
Name | Description
CustomPresentation
 Custom presentation GUID to be applied to the object type
HiddenLines
 The line type of the hidden lines of the reinforcement.
HideLinesHiddenByPart
 Defines whether lines hidden by parts should be hidden or not.
HideLinesHiddenByReinforcement
 Defines whether lines hidden by reinforcements should be hidden or not.
ReinforcementRepresentation
 The representation of reinforcing bars.
VisibleLines
 The line type of the visible lines of the reinforcement.
Top
Methods
Name | Description
IsEqual
 Compares the current object with an object of the same type.
 (Overrides AttributesBase.IsEqual(Object).)
LoadAttributes
 Loads the attributes from the attribute file.
 (Overrides AttributesBase.LoadAttributes(String).)
Top
See Also
Reference
Tekla.Structures.Drawing Namespace